'''მომხმარებელს შემოყავს სამნშნა რიცხვი. დათვალეთ და დაბეჭდეთ რა
ნაშთს გვაძლევს შემოყვანილი რიცხვი მის ციფრთა ჯამზე გაყოფისას.
მაგალითად, თუ მომხმარებელმა შემოიყვანა რიხვი 120, მისი ციფრთა
ჯამია: 1 + 2 + 0 = 3. 120 ის ნაშთი 3 ზე გაყოფისას 0 ია. ამიტომ უნდა
დაბეჭდოთ 0.'''

def input(num):
    sum= 0
    for i in str(num):
        sum+=int(i)
    return num % sum   
print(input(120))
        

'''2) დაწერეთ პროგრამა რომელიც შემოსულ მთელ რიცხვს გაზრდის ერთით თუ ის კენტია. 
საბოლოოდ ორივე შემთხვევაში გამობეჭდეთ ეს რიცხვი. 
(თუ ამოხსნაში გამოიყენეთ if ოპერატორი მისაღებია თუმცა გირჩევთ სცადოთ ამოცანის შესრულება მისი გამოყენების გარეშეც)'''

  

def kent(num):
    if num%2 == 1:
        return num + 1
    else:
        return num

ricxvi = int(input('sheiyvane ricxvi'))
shedegi = kent(ricxvi)
print( shedegi )



'''3) დაწერეთ პროგრამა რომელიც კლავიატურიდან შეტანილ მთელი რიცხვს გაზრდის
5-ით, თუ ის ლუწია და გაზრდის 3-ჯერ, თუ კენტია, შემდეგ კი შეინახავს მათი
ჯამის 5-ზე გაყოფის ნაშთს და დაბეჭდავს ეკრანზე.'''

def ricxvi(num):
    if num % 2 == 0:
        return num + 5 
    elif num % 2 != 0:
        return num + 3
    
cvladi = int(input('sheiyvanet ricxvi: '))
shedegi = ricxvi(cvladi)
print("shedegi: ", shedegi)


'''4)  f''-ის გამოყენებით შექმენიტ ერთი დიდი ტექსტი სადაც შევა მომხმარებლის მიერ შეყვანილი: სახელი, გვარი, ასაკი, ქვეყანა'''

saxeli = input("saxeli")
gvari = input('gvari')
asaki = int(input('asaki'))
qveyana = input('qveyana')

print(f'{saxeli} {gvari} {asaki} {qveyana}')

'''5)ახსენით რომელი გირჩევნით და რატომ:
num = 2
print("Hello " + str(num) + " world")
print("Hello", num, "world")
print(f'Hello {num} world')'''

'მესამე ვარიანტი არის უფრო მოსახერხებელი ანუ f - სტრინგის გამოყენება, იმიტომ რომ ცვლადის ჩასმა შესაძლებელი მძიმეების  და პლუსების გარეშე ანუ როდესაც ბევრ ცვლადს იყენებ აღარ გჭირდება ზედმეტი მოქმედებების გაკეთება და კოდიც უფრო წასაკითხი ხდება დანარჩენ ვარიანტებთან შედარებით.'







