'''შექმენით list-ი შემდეგი მნიშვნელობებით: [1,4,3,6,9,11,17,13,26,30], თქვენი დავალებაა გამოტანოთ ლუწი რიცხვების ჯამი და კენტი რიცხვების რაოდენობა'''


def ricxvebi(list):
    jami = 0
    kenti = 0
    for i in list:
        if i%2 == 0:
            jami+=i
         
        elif i%2 !=0:
            kenti+= 1
    return jami, kenti
    
   
print(ricxvebi([1,4,3,6,9,11,17,13,26,30]))

        # 2) შექმნით list და ბოლოში ჩაამატეთ ნებისმიერი მნიშვნელობა (append)

num = [1,34,54]
num.append(12)
print(num)

# 3)# 3. მოცემული list-იდან: [1,2,3,3,4,5] ამოშალეთ ის რიცხვი რომელიც არღვევს თანმიმდევრობას (pop)

num = [1,2,3,3,4,5]
num.pop(3)
print(num)


#  4. list-ში: [1,2,3,4,6,8,9] ჩაამატეთ ის ციფრები რომელიც არის გამოტოვებული (insert)

num = [1,2,3,4,6,8,9]
num.insert(4,5)
num.insert(6,7)
print(num)

# 5. კომენტარის სახით დაწერეთ რას აკეთებს append, pop, insert

# append - ამატაებს ელემენტს ლისთის ბოლოში
# pop - აკლებს ელემენტს რომელიც გვინდა, რომ მოაკლდეს ინდექსის მიხედვით
# insert - ამატებს ელემენტს რომელ ინდექსზეც გვინდა და რა ერლემენტიც გვინდა


name = ['nika','goga','gio']
name.remove('gio')
print(name)


