#1) შექმენით პროგრამა, რომელშიც მომხმარებელი შემოიტანს რიცხვს, თქვენ უნდა გამოიტანოთ ამ რიცხვის ყველა გამყოფი (ის რიცხვები რომლებზეც გაყოფისას მომხმარებლის მიერ შემოტანილ რიცხვზე ნაშთი 0-ია)

num =int(input('enter number'))

for i in range(1,num + 1):
    if num%i == 0:
        print(i)        



#2) ახსენით რა განსხვავებაა While და for loop-ებს შორის

# ორივე ციკლი არის მსგავსი მაგრამ განსხვავება სინტაქსში მდგომარეობს, for ციკლი პირველ და ბოლო საფეხურ თავისით აკეთებს ხოლო while ციკლში პირველი და ბოლო საფეხურს ხელით ვაკეთებთ. while ციკლით შესაძლებელია ასევე უსასრულო იტერაცია


#4) რა არის ამ გამოსახულების პასუხი: პასუხი იქნება true
#(1 and 0) or (1 and 1) and (0 or 0)


for i in range(1,101):
    print(sum(i))

