'''#1) შექმენით პროგრამა რომელიც მომხმარებელს მოთხოვს რაიმე ტექსტს და შემდეგ რიცხვს. პროგრამამ უნდა გამოიტანოს ამ ტექსტის შესაბამისი ასო რიცსვის მიხედვით ტექსტი - 'hello", რიცხვი - 2 ----> 'e'
word = input('enter word: ')
index = int(input('enter number: '))
print(word[index - 1])




#2) შექმენით პროგრამა რომელსც 100 დან - 1მდე გამოაქვს რიცხვები.

for i in range(100,0,-1):
    print(i)



#3) შექმენით პროგრამა რომელიც 1-100 მდე გამოაქვს მხოლოდ კენტი რიცხვები

for i in range(1,100):
    if i%2==1:
        print(i)


#4) შექმენით პროგრამა რომელსაც ათ-ათობით გამოაქვს 250-500მდე რიცხვები

for i in range(250,500,10):
    print(i)



#5) შექმენით პროგრამა რომელშიც შემოაყვანინებთ მომხმარებელს რაიმე სიყვას და თუ ეს სიტყვა იწყება "_"-ით მაშინ გამოიტანეთ True - თუ არა False

'''






#6) შექმენით პროგრამა რომელიც მომხმარებელს ეკითხება რიცხვს და თუ ეს ტიცხვი ლუწია 10-ჯერ გამოუტანს "yes", ხოლო თუ ის კენტია "No'-ს

num = int(input("enter number"))

for i in range(1, num):
    if num%i == 0:
        
        print('yes' * 10)
        break
else:
    print("no")       














