#1) მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ for ციკლის გამოყენებით, გამოთვალეთ და გამოიტანეთ მხოლოდ კენტი რიცხვების ჯამი.
num = int(input('enter number'))
sum = 0
for i in range(1,num):
    if i%2 == 1:
        sum += i
print(sum)        



#2)მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ for ციკლის გამოყენებით გამოიტანეთ მხოლოდ ის რიცხვები, რომლებზეც უნაშთოდ იყოფა შემოტანილი რიცხვი

num = int(input('enter number'))

for i in range(1,num):
    if i%num == 0:
        print(i)


#3) 4)ეს შედარებით რთულია და თუ ვერ გააკეთეთ არაუშავრა მომხმარებელს შემოატანინეთ რაიმე stringი და for ციკლის გამოყენებით დააბრუნეთ ეს სტრინგი შემოტრიალებული

string= input('sheiyvant ricxvi')
st=""
for i in string:
    st+=i
print(st[::-1])    





