name = "nika"


surename = "gelashvili"

print(name)

# name არის ცვლადი
# =  არის ცვლადისთვის მნიშვნელობის მიმნიჭებელი სიმბოლო
#"nika" - არის მნიშვნელობა

# print ფუნქციას გადაეცემა ეკრანზე გამოსატანი ცვლადი ან სტრინგი

name = "nika" # (string) str _ ტიპის ცვლადი, სტრინგი არის ბრჭალებში "" მოქცეული სიმბოლოები
age = 30 #ეს არის ცვლადი int (integer) მთელი რიცხვი 
heigh = 178.6 # float ტიპის ცვლადი ანუ ათწილადი
# არსებობს boolean tipis ცვლადი

knows_programming = True
is_ugly = False
# ნებისმიერი ცვლადი რომელიც რამოდენიმე სიტყვისგან შედგება გამოიყოფა _ ქვედა ტირეთი

print(name + " " + surename) # ტერმინალში ჯერ იწერება ლოკაცია ფაილის მდებარეობის 

print(type(age)) # ამ პრინტით ტერმინალში მოდის ინფრმაცია, რომ "ასაკი" არის ინტეჯერ ანუ მთელი რიცხვი
print(type(name)) # ეს ტიპი არის ე.წ სტრინგი
print(type(heigh)) # float ტიპის ცვლადი
print(type(is_ugly)) # bool ტიპის ცვლადი ტერმინალში

print(name + " " + str(age)) # ამ შემთხვევაში ასაკი არის რიცხვი ანუ (int) მაგრამ შეგვიძლია გავსტრინგოთ თუ ასაკს წინ str ფუნქციას დავუწერთ


